7767517
52 62
Input                    data                     0 1 data -23330=4,3,1280,1280,1 0=1280 1=1280 2=1
Convolution              0_12                     1 1 data 0_12_bn_leaky -23330=4,3,640,640,72 0=72 1=3 3=2 4=1 5=1 6=648 9=2 -23310=1,1.000000e-01
Convolution              1_20                     1 1 0_12_bn_leaky 1_20_bn_leaky -23330=4,3,320,320,96 0=96 1=3 3=2 4=1 5=1 6=62208 9=2 -23310=1,1.000000e-01
Convolution              2_28                     1 1 1_20_bn_leaky 2_28_bn_leaky -23330=4,3,320,320,96 0=96 1=3 4=1 5=1 6=82944 9=2 -23310=1,1.000000e-01
Split                    2_28_bn_leaky_split      1 2 2_28_bn_leaky 2_28_bn_leaky_split_0 2_28_bn_leaky_split_1 -23330=8,3,320,320,96,3,320,320,96
Crop                     3_36                     1 1 2_28_bn_leaky_split_0 3_36 -23330=4,3,320,320,48 2=48 3=320 4=320 5=48
Convolution              4_41                     1 1 3_36 4_41_bn_leaky -23330=4,3,320,320,72 0=72 1=3 4=1 5=1 6=31104 9=2 -23310=1,1.000000e-01
Split                    4_41_bn_leaky_split      1 2 4_41_bn_leaky 4_41_bn_leaky_split_0 4_41_bn_leaky_split_1 -23330=8,3,320,320,72,3,320,320,72
Convolution              5_49                     1 1 4_41_bn_leaky_split_0 5_49_bn_leaky -23330=4,3,320,320,72 0=72 1=3 4=1 5=1 6=46656 9=2 -23310=1,1.000000e-01
Concat                   6_57                     2 1 5_49_bn_leaky 4_41_bn_leaky_split_1 6_57 -23330=4,3,320,320,144
Convolution              7_60                     1 1 6_57 7_60_bn_leaky -23330=4,3,320,320,96 0=96 1=1 5=1 6=13824 9=2 -23310=1,1.000000e-01
Concat                   8_68                     2 1 2_28_bn_leaky_split_1 7_60_bn_leaky 8_68 -23330=4,3,320,320,192
Pooling                  9_71                     1 1 8_68 9_71 -23330=4,3,160,160,192 1=2 2=2 5=1
Convolution              10_75                    1 1 9_71 10_75_bn_leaky -23330=4,3,160,160,144 0=144 1=3 4=1 5=1 6=248832 9=2 -23310=1,1.000000e-01
Split                    10_75_bn_leaky_split     1 2 10_75_bn_leaky 10_75_bn_leaky_split_0 10_75_bn_leaky_split_1 -23330=8,3,160,160,144,3,160,160,144
Crop                     11_83                    1 1 10_75_bn_leaky_split_0 11_83 -23330=4,3,160,160,72 2=72 3=160 4=160 5=72
Convolution              12_88                    1 1 11_83 12_88_bn_leaky -23330=4,3,160,160,96 0=96 1=3 4=1 5=1 6=62208 9=2 -23310=1,1.000000e-01
Split                    12_88_bn_leaky_split     1 2 12_88_bn_leaky 12_88_bn_leaky_split_0 12_88_bn_leaky_split_1 -23330=8,3,160,160,96,3,160,160,96
Convolution              13_96                    1 1 12_88_bn_leaky_split_0 13_96_bn_leaky -23330=4,3,160,160,96 0=96 1=3 4=1 5=1 6=82944 9=2 -23310=1,1.000000e-01
Concat                   14_104                   2 1 13_96_bn_leaky 12_88_bn_leaky_split_1 14_104 -23330=4,3,160,160,192
Convolution              15_107                   1 1 14_104 15_107_bn_leaky -23330=4,3,160,160,144 0=144 1=1 5=1 6=27648 9=2 -23310=1,1.000000e-01
Split                    15_107_bn_leaky_split    1 2 15_107_bn_leaky 15_107_bn_leaky_split_0 15_107_bn_leaky_split_1 -23330=8,3,160,160,144,3,160,160,144
Concat                   16_115                   2 1 10_75_bn_leaky_split_1 15_107_bn_leaky_split_0 16_115 -23330=4,3,160,160,288
Pooling                  17_118                   1 1 16_115 17_118 -23330=4,3,80,80,288 1=2 2=2 5=1
Convolution              18_122                   1 1 17_118 18_122_bn_leaky -23330=4,3,80,80,160 0=160 1=3 4=1 5=1 6=414720 9=2 -23310=1,1.000000e-01
Split                    18_122_bn_leaky_split    1 2 18_122_bn_leaky 18_122_bn_leaky_split_0 18_122_bn_leaky_split_1 -23330=8,3,80,80,160,3,80,80,160
Crop                     19_130                   1 1 18_122_bn_leaky_split_0 19_130 -23330=4,3,80,80,80 2=80 3=80 4=80 5=80
Convolution              20_135                   1 1 19_130 20_135_bn_leaky -23330=4,3,80,80,144 0=144 1=3 4=1 5=1 6=103680 9=2 -23310=1,1.000000e-01
Split                    20_135_bn_leaky_split    1 2 20_135_bn_leaky 20_135_bn_leaky_split_0 20_135_bn_leaky_split_1 -23330=8,3,80,80,144,3,80,80,144
Convolution              21_143                   1 1 20_135_bn_leaky_split_0 21_143_bn_leaky -23330=4,3,80,80,144 0=144 1=3 4=1 5=1 6=186624 9=2 -23310=1,1.000000e-01
Concat                   22_151                   2 1 21_143_bn_leaky 20_135_bn_leaky_split_1 22_151 -23330=4,3,80,80,288
Convolution              23_154                   1 1 22_151 23_154_bn_leaky -23330=4,3,80,80,160 0=160 1=1 5=1 6=46080 9=2 -23310=1,1.000000e-01
Split                    23_154_bn_leaky_split    1 2 23_154_bn_leaky 23_154_bn_leaky_split_0 23_154_bn_leaky_split_1 -23330=8,3,80,80,160,3,80,80,160
Concat                   24_162                   2 1 18_122_bn_leaky_split_1 23_154_bn_leaky_split_0 24_162 -23330=4,3,80,80,320
Pooling                  25_165                   1 1 24_162 25_165 -23330=4,3,40,40,320 1=2 2=2 5=1
Convolution              26_169                   1 1 25_165 26_169_bn_leaky -23330=4,3,40,40,320 0=320 1=3 4=1 5=1 6=921600 9=2 -23310=1,1.000000e-01
Convolution              27_177                   1 1 26_169_bn_leaky 27_177_bn_leaky -23330=4,3,40,40,160 0=160 1=1 5=1 6=51200 9=2 -23310=1,1.000000e-01
Split                    27_177_bn_leaky_split    1 2 27_177_bn_leaky 27_177_bn_leaky_split_0 27_177_bn_leaky_split_1 -23330=8,3,40,40,160,3,40,40,160
Convolution              28_185                   1 1 27_177_bn_leaky_split_0 28_185_bn_leaky -23330=4,3,40,40,320 0=320 1=3 4=1 5=1 6=460800 9=2 -23310=1,1.000000e-01
Convolution              29_193                   1 1 28_185_bn_leaky 29_193 -23330=4,3,40,40,39 0=39 1=1 5=1 6=12480
Convolution              32_212                   1 1 27_177_bn_leaky_split_1 32_212_bn_leaky -23330=4,3,40,40,144 0=144 1=1 5=1 6=23040 9=2 -23310=1,1.000000e-01
Interp                   33_220                   1 1 32_212_bn_leaky 33_220 -23330=4,3,80,80,144 0=1 1=2.000000e+00 2=2.000000e+00
Concat                   34_223                   2 1 33_220 23_154_bn_leaky_split_1 34_223 -23330=4,3,80,80,304
Convolution              35_226                   1 1 34_223 35_226_bn_leaky -23330=4,3,80,80,160 0=160 1=3 4=1 5=1 6=437760 9=2 -23310=1,1.000000e-01
Split                    35_226_bn_leaky_split    1 2 35_226_bn_leaky 35_226_bn_leaky_split_0 35_226_bn_leaky_split_1 -23330=8,3,80,80,160,3,80,80,160
Convolution              36_234                   1 1 35_226_bn_leaky_split_0 36_234 -23330=4,3,80,80,39 0=39 1=1 5=1 6=6240
Convolution              39_253                   1 1 35_226_bn_leaky_split_1 39_253_bn_leaky -23330=4,3,80,80,96 0=96 1=1 5=1 6=15360 9=2 -23310=1,1.000000e-01
Interp                   40_261                   1 1 39_253_bn_leaky 40_261 -23330=4,3,160,160,96 0=1 1=2.000000e+00 2=2.000000e+00
Concat                   41_264                   2 1 40_261 15_107_bn_leaky_split_1 41_264 -23330=4,3,160,160,240
Convolution              42_267                   1 1 41_264 42_267_bn_leaky -23330=4,3,160,160,144 0=144 1=3 4=1 5=1 6=311040 9=2 -23310=1,1.000000e-01
Convolution              43_275                   1 1 42_267_bn_leaky 43_275 -23330=4,3,160,160,39 0=39 1=1 5=1 6=5616
Yolov3DetectionOutput    detection_out            3 1 29_193 36_234 43_275 output -23330=4,2,6,60828,1 0=8 1=3 2=2.500000e-01 -23304=18,5.000000e+00,3.000000e+01,3.000000e+01,5.000000e+00,3.000000e+01,3.000000e+01,1.000000e+01,6.000000e+01,6.000000e+01,1.000000e+01,6.000000e+01,6.000000e+01,2.000000e+01,1.200000e+02,1.200000e+02,2.000000e+01,1.200000e+02,1.200000e+02 -23305=9,1086324736,1088421888,1090519040,1077936128,1082130432,1084227584,0,1065353216,1073741824 -23306=3,3.200000e+01,1.600000e+01,8.000000e+00
