7767517
52 62
Input                    data                     0 1 data -23330=4,3,416,416,3 0=416 1=416 2=3
Convolution              0_27                     1 1 data 0_27_bn_leaky -23330=4,3,208,208,32 0=32 1=3 3=2 4=1 5=1 6=864 9=2 -23310=1,1.000000e-01
Convolution              1_35                     1 1 0_27_bn_leaky 1_35_bn_leaky -23330=4,3,104,104,32 0=32 1=3 3=2 4=1 5=1 6=9216 9=2 -23310=1,1.000000e-01
Convolution              2_43                     1 1 1_35_bn_leaky 2_43_bn_leaky -23330=4,3,104,104,64 0=64 1=3 4=1 5=1 6=18432 9=2 -23310=1,1.000000e-01
Split                    2_43_bn_leaky_split      1 2 2_43_bn_leaky 2_43_bn_leaky_split_0 2_43_bn_leaky_split_1 -23330=8,3,104,104,64,3,104,104,64
Crop                     3_51                     1 1 2_43_bn_leaky_split_0 3_51 -23330=4,3,104,104,32 2=32 3=104 4=104 5=32
Convolution              4_56                     1 1 3_51 4_56_bn_leaky -23330=4,3,104,104,32 0=32 1=3 4=1 5=1 6=9216 9=2 -23310=1,1.000000e-01
Split                    4_56_bn_leaky_split      1 2 4_56_bn_leaky 4_56_bn_leaky_split_0 4_56_bn_leaky_split_1 -23330=8,3,104,104,32,3,104,104,32
Convolution              5_64                     1 1 4_56_bn_leaky_split_0 5_64_bn_leaky -23330=4,3,104,104,32 0=32 1=3 4=1 5=1 6=9216 9=2 -23310=1,1.000000e-01
Concat                   6_72                     2 1 5_64_bn_leaky 4_56_bn_leaky_split_1 6_72 -23330=4,3,104,104,64
Convolution              7_75                     1 1 6_72 7_75_bn_leaky -23330=4,3,104,104,64 0=64 1=1 5=1 6=4096 9=2 -23310=1,1.000000e-01
Concat                   8_83                     2 1 2_43_bn_leaky_split_1 7_75_bn_leaky 8_83 -23330=4,3,104,104,128
Convolution              9_86                     1 1 8_83 9_86_bn_leaky -23330=4,3,52,52,64 0=64 1=3 3=2 4=1 5=1 6=73728 9=2 -23310=1,1.000000e-01
Convolution              10_94                    1 1 9_86_bn_leaky 10_94_bn_leaky -23330=4,3,52,52,128 0=128 1=3 4=1 5=1 6=73728 9=2 -23310=1,1.000000e-01
Split                    10_94_bn_leaky_split     1 2 10_94_bn_leaky 10_94_bn_leaky_split_0 10_94_bn_leaky_split_1 -23330=8,3,52,52,128,3,52,52,128
Crop                     11_102                   1 1 10_94_bn_leaky_split_0 11_102 -23330=4,3,52,52,64 2=64 3=52 4=52 5=64
Convolution              12_107                   1 1 11_102 12_107_bn_leaky -23330=4,3,52,52,64 0=64 1=3 4=1 5=1 6=36864 9=2 -23310=1,1.000000e-01
Split                    12_107_bn_leaky_split    1 2 12_107_bn_leaky 12_107_bn_leaky_split_0 12_107_bn_leaky_split_1 -23330=8,3,52,52,64,3,52,52,64
Convolution              13_115                   1 1 12_107_bn_leaky_split_0 13_115_bn_leaky -23330=4,3,52,52,64 0=64 1=3 4=1 5=1 6=36864 9=2 -23310=1,1.000000e-01
Concat                   14_123                   2 1 13_115_bn_leaky 12_107_bn_leaky_split_1 14_123 -23330=4,3,52,52,128
Convolution              15_126                   1 1 14_123 15_126_bn_leaky -23330=4,3,52,52,128 0=128 1=1 5=1 6=16384 9=2 -23310=1,1.000000e-01
Split                    15_126_bn_leaky_split    1 2 15_126_bn_leaky 15_126_bn_leaky_split_0 15_126_bn_leaky_split_1 -23330=8,3,52,52,128,3,52,52,128
Concat                   16_134                   2 1 10_94_bn_leaky_split_1 15_126_bn_leaky_split_0 16_134 -23330=4,3,52,52,256
Convolution              17_137                   1 1 16_134 17_137_bn_leaky -23330=4,3,26,26,128 0=128 1=3 3=2 4=1 5=1 6=294912 9=2 -23310=1,1.000000e-01
Convolution              18_145                   1 1 17_137_bn_leaky 18_145_bn_leaky -23330=4,3,26,26,192 0=192 1=3 4=1 5=1 6=221184 9=2 -23310=1,1.000000e-01
Split                    18_145_bn_leaky_split    1 2 18_145_bn_leaky 18_145_bn_leaky_split_0 18_145_bn_leaky_split_1 -23330=8,3,26,26,192,3,26,26,192
Crop                     19_153                   1 1 18_145_bn_leaky_split_0 19_153 -23330=4,3,26,26,96 2=96 3=26 4=26 5=96
Convolution              20_158                   1 1 19_153 20_158_bn_leaky -23330=4,3,26,26,128 0=128 1=3 4=1 5=1 6=110592 9=2 -23310=1,1.000000e-01
Split                    20_158_bn_leaky_split    1 2 20_158_bn_leaky 20_158_bn_leaky_split_0 20_158_bn_leaky_split_1 -23330=8,3,26,26,128,3,26,26,128
Convolution              21_166                   1 1 20_158_bn_leaky_split_0 21_166_bn_leaky -23330=4,3,26,26,128 0=128 1=3 4=1 5=1 6=147456 9=2 -23310=1,1.000000e-01
Concat                   22_174                   2 1 21_166_bn_leaky 20_158_bn_leaky_split_1 22_174 -23330=4,3,26,26,256
Convolution              23_177                   1 1 22_174 23_177_bn_leaky -23330=4,3,26,26,192 0=192 1=1 5=1 6=49152 9=2 -23310=1,1.000000e-01
Split                    23_177_bn_leaky_split    1 2 23_177_bn_leaky 23_177_bn_leaky_split_0 23_177_bn_leaky_split_1 -23330=8,3,26,26,192,3,26,26,192
Concat                   24_185                   2 1 18_145_bn_leaky_split_1 23_177_bn_leaky_split_0 24_185 -23330=4,3,26,26,384
Convolution              25_188                   1 1 24_185 25_188_bn_leaky -23330=4,3,13,13,192 0=192 1=3 3=2 4=1 5=1 6=663552 9=2 -23310=1,1.000000e-01
Convolution              26_196                   1 1 25_188_bn_leaky 26_196_bn_leaky -23330=4,3,13,13,256 0=256 1=3 4=1 5=1 6=442368 9=2 -23310=1,1.000000e-01
Convolution              27_207                   1 1 26_196_bn_leaky 27_207_bn_leaky -23330=4,3,13,13,192 0=192 1=1 5=1 6=49152 9=2 -23310=1,1.000000e-01
Split                    27_207_bn_leaky_split    1 2 27_207_bn_leaky 27_207_bn_leaky_split_0 27_207_bn_leaky_split_1 -23330=8,3,13,13,192,3,13,13,192
Convolution              28_215                   1 1 27_207_bn_leaky_split_0 28_215_bn_leaky -23330=4,3,13,13,256 0=256 1=3 4=1 5=1 6=442368 9=2 -23310=1,1.000000e-01
Convolution              29_223                   1 1 28_215_bn_leaky 29_223 -23330=4,3,13,13,66 0=66 1=1 5=1 6=16896
Convolution              32_252                   1 1 27_207_bn_leaky_split_1 32_252_bn_leaky -23330=4,3,13,13,128 0=128 1=1 5=1 6=24576 9=2 -23310=1,1.000000e-01
Interp                   33_260                   1 1 32_252_bn_leaky 33_260 -23330=4,3,26,26,128 0=1 1=2.000000e+00 2=2.000000e+00
Concat                   34_263                   2 1 33_260 23_177_bn_leaky_split_1 34_263 -23330=4,3,26,26,320
Convolution              35_266                   1 1 34_263 35_266_bn_leaky -23330=4,3,26,26,192 0=192 1=3 4=1 5=1 6=552960 9=2 -23310=1,1.000000e-01
Split                    35_266_bn_leaky_split    1 2 35_266_bn_leaky 35_266_bn_leaky_split_0 35_266_bn_leaky_split_1 -23330=8,3,26,26,192,3,26,26,192
Convolution              36_274                   1 1 35_266_bn_leaky_split_0 36_274 -23330=4,3,26,26,66 0=66 1=1 5=1 6=12672
Convolution              39_302                   1 1 35_266_bn_leaky_split_1 39_302_bn_leaky -23330=4,3,26,26,64 0=64 1=1 5=1 6=12288 9=2 -23310=1,1.000000e-01
Interp                   40_310                   1 1 39_302_bn_leaky 40_310 -23330=4,3,52,52,64 0=1 1=2.000000e+00 2=2.000000e+00
Concat                   41_313                   2 1 40_310 15_126_bn_leaky_split_1 41_313 -23330=4,3,52,52,192
Convolution              42_316                   1 1 41_313 42_316_bn_leaky -23330=4,3,52,52,128 0=128 1=3 4=1 5=1 6=221184 9=2 -23310=1,1.000000e-01
Convolution              43_324                   1 1 42_316_bn_leaky 43_324 -23330=4,3,52,52,66 0=66 1=1 5=1 6=8448
Yolov3DetectionOutput    detection_out            3 1 29_223 36_274 43_324 output -23330=4,2,6,7209,1 0=17 1=3 2=2.500000e-01 -23304=18,1.000000e+01,1.000000e+01,1.000000e+01,3.000000e+01,3.000000e+01,1.000000e+01,5.000000e+01,5.000000e+01,5.000000e+01,1.000000e+02,1.000000e+02,5.000000e+01,6.000000e+01,6.000000e+01,9.000000e+01,9.000000e+01,1.200000e+02,1.200000e+02 -23305=9,1086324736,1088421888,1090519040,1077936128,1082130432,1084227584,0,1065353216,1073741824 -23306=3,3.200000e+01,1.600000e+01,8.000000e+00
